sitemap.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<!-- <link rel="stylesheet" type="text/css" href="/ox.css"/> -->
<link rel="stylesheet" type="text/css" href="/custom.css"/>
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=JetBrains+Mono" rel="stylesheet">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css">
<!-- copy org-blocks to clipboard  -->
</head>
<body>
<div id="preamble" class="status">
<hr style="border-top: 1px solid black;">
<div class='topnav' style='display: flex; justify-content: space-between; align-items: center;'>
  <h2 style='margin-top: 0; margin-bottom: 0; margin-left:0px;'>Javier Pacheco</h2> 
  <div>
    <a href='/index.html' style='font-weight:bold;'>Home</a> |
    <a href='/archive.html' style='font-weight:bold;'>Blog</a> | 
    <a href='/about.html' style='font-weight:bold;'>About Me</a> | 
  </div>
</div>
<hr style="border-top: 1px solid black;">
</div>
<div id="content" class="content">
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org336a7a9">(2024-05-27) Posts Archive</a></li>
<li><a href="#orgacf13b7">(2024-05-27) Javier Pacheco</a></li>
<li><a href="#org23dcc15">(2024-05-27) About Me</a></li>
<li><a href="#org3fcee7b">posts</a>
<ul>
<li><a href="#orge9fc464">(2024-05-27) My Hyprland Config</a></li>
<li><a href="#org11ad0d9">(2024-01-14) Emacs Fetching tool - efetch.el</a></li>
<li><a href="#org5920545">(2024-01-05) Copy html source from org files to the clipboard.</a></li>
<li><a href="#orgaf0524f">(2024-01-01) Voidstrap a tui void linux installator</a></li>
<li><a href="#org2371f40">(2023-12-29) Copy org blocks to clipboard</a></li>
<li><a href="#orgc691684">(2023-12-26) Attempt to test RSS feeds</a></li>
<li><a href="#orga7795d2">(2023-12-25) Denote silo function</a></li>
<li><a href="#orgc52915f">(2023-12-23) Themes and end of the year</a></li>
<li><a href="#orgaa3c1b8">(2023-12-23) Testing the build-site.</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-org336a7a9" class="outline-2">
<h2 id="org336a7a9"><a href="archive.html">(2024-05-27) Posts Archive</a></h2>
<div class="outline-text-2" id="text-org336a7a9">
<p>
(No preview)
</p>
</div>
</div>
<div id="outline-container-orgacf13b7" class="outline-2">
<h2 id="orgacf13b7"><a href="index.html">(2024-05-27) Javier Pacheco</a></h2>
<div class="outline-text-2" id="text-orgacf13b7">
<p>
(No preview)
</p>
</div>
</div>
<div id="outline-container-org23dcc15" class="outline-2">
<h2 id="org23dcc15"><a href="about.html">(2024-05-27) About Me</a></h2>
<div class="outline-text-2" id="text-org23dcc15">
<p>
(No preview)
</p>
</div>
</div>
<div id="outline-container-org3fcee7b" class="outline-2">
<h2 id="org3fcee7b">posts</h2>
<div class="outline-text-2" id="text-org3fcee7b">
</div>
<div id="outline-container-orge9fc464" class="outline-3">
<h3 id="orge9fc464"><a href="posts/my_hyprland_config.html">(2024-05-27) My Hyprland Config</a></h3>
<div class="outline-text-3" id="text-orge9fc464">
<p>
Hello, in this post I'm going to share and explain a little bit my <code>Hyprland</code> configuration, I'm not an expert in this window manager, but I really like it, I think this WM have a great future, and for me, this one is the best out there, of course there are some more, more solids if you will, but this is awesome.
</p>
</div>
</div>
<div id="outline-container-org11ad0d9" class="outline-3">
<h3 id="org11ad0d9"><a href="posts/emacs-fetching-tool-efetchel.html">(2024-01-14) Emacs Fetching tool - efetch.el</a></h3>
<div class="outline-text-3" id="text-org11ad0d9">
<p>
Embrace a new level of Emacs mastery with <code>efetch.el</code> – a powerful and user-friendly Emacs Fetching Tool. Designed for enthusiasts who crave insights into their Emacs environment, <code>efetch.el</code> provides a seamless way to peek under the hood of your setup. With just a simple command, unlock a left-side buffer showcasing key details such as Emacs version, host information, user details, installed packages, active theme, and default font. Customizable and accessible, this tool not only delivers a quick snapshot of your Emacs configuration but also opens the door for collaborative enhancements. Join the community on <a href="https://github.com/engjpacheco/efetch.el">GitHub</a>, contribute your ideas, and elevate your Emacs experience with <code>efetch.el</code> today!
</p>
</div>
</div>
<div id="outline-container-org5920545" class="outline-3">
<h3 id="org5920545"><a href="posts/export-org-files-to-html-and-clipboard.html">(2024-01-05) Copy html source from org files to the clipboard.</a></h3>
<div class="outline-text-3" id="text-org5920545">
<p>
If you uses email a lot like me in your job, but also use emacs, you wonder if is possible
to export your org files to <code>html</code>, and paste in to your email, well, we are in emacs,
everything is possible within emacs, so in this post, I'll show you a couple of functions
that help me to make my workflow more efficient.
</p>
</div>
</div>
<div id="outline-container-orgaf0524f" class="outline-3">
<h3 id="orgaf0524f"><a href="posts/voidstrap-a-tui-void-linux-installator.html">(2024-01-01) Voidstrap a tui void linux installator</a></h3>
<div class="outline-text-3" id="text-orgaf0524f">
<p>
This is the first post of the 2024, this is a project that I am working on in the last
year, is a minimialist voidlinux instalator it is based in some recomendations in 
a guides that some friends of my have but "semiautomated".
</p>
</div>
</div>
<div id="outline-container-org2371f40" class="outline-3">
<h3 id="org2371f40"><a href="posts/copy-org-blocks-to-clipboard.html">(2023-12-29) Copy org blocks to clipboard</a></h3>
<div class="outline-text-3" id="text-org2371f40">
<p>
In this post I'll demostrate how to add a button to copy the content of a 
src block generated by ox-publish in emacs within org-mode, this script
create a button in every instance of codeblock in the html file that ox-publish
generate when create the web-page content.
</p>
</div>
</div>
<div id="outline-container-orgc691684" class="outline-3">
<h3 id="orgc691684"><a href="posts/attempt-to-test-rss-feeds.html">(2023-12-26) Attempt to test RSS feeds</a></h3>
<div class="outline-text-3" id="text-orgc691684">
<p>
Hello.
</p>

<p>
This post, is about  more like a testing, because, I'm trying to add RSS feeds into 
this "web-page", so basically this is a test, and see if when I build the webpage
is going to work&#x2026; or not.
So, this is the preview and read this post to see what I'm trying to do.
</p>
</div>
</div>
<div id="outline-container-orga7795d2" class="outline-3">
<h3 id="orga7795d2"><a href="posts/denote-silo-function.html">(2023-12-25) Denote silo function</a></h3>
<div class="outline-text-3" id="text-orga7795d2">
<p>
I have been reading some thing information about denote, and its powerful tools
that the good <code>prots</code> give to us the mortals. I am starting this "post" thing, and 
is good to have my notes apart from the posts that I'm going to write in the 
future, so reading I find a interesting function that prots suggest to use 
in the creation of notes.
</p>
</div>
</div>
<div id="outline-container-orgc52915f" class="outline-3">
<h3 id="orgc52915f"><a href="posts/themes-and-end-of-the-year.html">(2023-12-23) Themes and end of the year</a></h3>
<div class="outline-text-3" id="text-orgc52915f">
<p>
This is the first of a few posts I'm creating this "web" only for my knowledge,
and contribute with some of it.
</p>

<p>
Some things are happening by a reason, so, instead of see the "bad" things that
happens; is a better practice to see the good side of the thing, these more or less
are some phrases that my dad says to me when me and my family have some problems.
</p>
</div>
</div>
<div id="outline-container-orgaa3c1b8" class="outline-3">
<h3 id="orgaa3c1b8"><a href="posts/test.html">(2023-12-23) Testing the build-site.</a></h3>
<div class="outline-text-3" id="text-orgaa3c1b8">
<p>
Probando el script para crear mi web page desde elisp</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
